
"Messages.UnreadMark" = "Непрачытаныя паведамленні";
"Messages.ForwardHeader" = "Перадасланыя паведамленні";
"Messages.File.State.FetchingIn" = "Спампоўка %d%%";
"Messages.File.State.FetchingOut" = "Загрузка %d%%";
"Messages.File.State.Remote" = "Спампаваць";
"Messages.File.State.Local" = "Адлюстраваць праз Finder";
"Messages.DeletedMessage" = "Выдаленнае паведамленне";

"Messages.Placeholder.SentMessage" = "Напішыце паведамленне...";
"SearchField.Search" = "Пошук";
"Contacts.ContacsSeparator" = "Кантакты";
"Navigation.back" = "Назад";
"Navigation.Chat" = "Размова";
"Navigation.Edit" = "Рэдагаваць";
"Navigation.Done" = "Гатова";
"Navigation.Close" = "Закрыць";
"Navigation.Cancel" = "Скасаваць";

"Gallery.Counter" = "%d з %d";

"Peer.Status.bot" = "бот";
"Peer.Status.offline" = "не тут";
"Peer.Status.online" = "тут";
"Peer.Status.recently" = "быў(-ла) тут зусім нядаўна";
"Peer.Status.justNow" = "толькі што быў(-ла) тут";
"Peer.Status.lastWeek" = "быў(-ла) тут на гэтым тыдні";
"Peer.Status.lastMonth" = "быў(-ла) тут у гэтым месяцы";

"Peer.Status.Today" = "сёння";
"Peer.Status.Yesterday" = "учора";
"Peer.Status.LastSeenAt" = "быў(-ла) тут %@ а %@";


/* do not translate key with 'countable' suffix */
"Peer.Status.Member_countable" = "%d";
"Peer.Status.Member_zero" = "%d удзельнікаў";
"Peer.Status.Member_one" = "%d удзельнік";
"Peer.Status.Member_two" = "%d удзельнікаў";
"Peer.Status.Member_few" = "%d удзельнікаў";
"Peer.Status.Member_many" = "%d удзельнікаў";
"Peer.Status.Member_other" = "%d удзельнікаў";

/* do not translate key with 'countable' suffix */
"Peer.Status.Member.Online_countable" = "%d";
"Peer.Status.Member.Online_zero" = "%d  тут";
"Peer.Status.Member.Online_one" = "%d  тут";
"Peer.Status.Member.Online_two" = "%d  тут";
"Peer.Status.Member.Online_few" = "%d  тут";
"Peer.Status.Member.Online_many" = "%d  тут";
"Peer.Status.Member.Online_other" = "%d  тут";


/* do not translate key with 'countable' suffix */
"Peer.Status.minAgo_countable" = "%d";
"Peer.Status.minAgo_zero" = "быў(-ла) тут %d хв. таму";
"Peer.Status.minAgo_one" = "быў(-ла) тут %d хв. таму";
"Peer.Status.minAgo_two" = "быў(-ла) тут %d хв. таму";
"Peer.Status.minAgo_few" = "быў(-ла) тут %d хв. таму";
"Peer.Status.minAgo_many" = "быў(-ла) тут %d хв. таму";
"Peer.Status.minAgo_other" = "быў(-ла) тут %d хв. таму";

"Peer.Status.channel" = "канал";
"Peer.Status.group" = "суполка";

"Telegram.PeerInfoController" = "Звесткі";
"PeerInfo.SendMessage" = "Даслаць паведамленне";
"PeerInfo.ShareContact" = "Падзяліцца кантактам";
"PeerInfo.StartSecretChat" = "Пачаць сакрэтную размову";
"PeerInfo.SharedMedia" = "Агульныя медыя";
"PeerInfo.Notifications" = "Апавяшчэнні";
"PeerInfo.BlockUser" = "Заблакаваць карыстальніка";
"PeerInfo.UnblockUser" = "Разблакаваць карыстальніка";
"PeerInfo.username" = "мянушка";
"PeerInfo.about" = "звесткі";
"PeerInfo.info" = "Звесткі";
"PeerInfo.SetGroupPhoto" = "Змяніць выяву суполкі";
"PeerInfo.AddMember" = "Дадаць удзельніка";
"PeerInfo.DeleteAndExit" = "Выдаліць і выйсці";
"PeerInfo.LeaveChannel" = "Выйсці з канала";
"PeerInfo.Report" = "Паскардзіцца";
"PeerInfo.sharelink" = "падзяліцца спасылкай";
"PeerInfo.Confirm.LeaveChannel" = "Вы ўпэўненыя, што жадаеце выйсці з гэтага канала?";
"PeerInfo.Confirm.DeleteAndExit" = "Вы ўпэўненыя, што жадаеце выйсці з гэтага канала?";
"PeerInfo.Confirm.LeaveGroup" = "Вы ўпэўненыя, што жадаеце выйсці\nз гэтай суполкі?\n\nГэтае дзеянне немагчыма скасаваць.";
"PeerInfo.Confirm.DeleteChat" = "Вы сапраўды жадаеце выдаліць усе паведамленні і выйсці з \"%@\"?\n\nГэтае дзеянне немагчыма скасаваць.";
"Confirm.DeleteAdminedChannel" = "Пачакайце! Калі вы выдаліце гэты канал, удзельнікі страцяць доступ да яго, а паведамленні будуць выдаленыя. Вы сапраўды жадаеце гэта зрабіць?";
"Confirm.DeleteChatUser" = "Вы ўпэўненыя, што жадаеце выдаліць усю гісторыю паведамленняў?\n\nГэтае дзеянне немагчыма скасаваць.";
"Confirm.LeaveGroup" = "Вы ўпэўненыя, што жадаеце выйсці з гэтай суполкі? ";

"PeerMedia.SharedMedia" = "Агульныя медыя";
"EmptyPeer.Description" = "Абярыце размову, каб пачаць перапісвацца";

"Emoji.Recent" = "Часта ўжываныя";
"Emoji.SmilesAndPeople" = "Смайлы і людзі";
"Emoji.AnimalsAndNature" = "Жывёлы і прырода";
"Emoji.FoodAndDrink" = "Ежа і пітво";
"Emoji.ActivityAndSport" = "Заняткі і спорт";
"Emoji.TravelAndPlaces" = "Вандроўкі і месцы";
"Emoji.Objects" = "Аб’екты";
"Emoji.Symbols" = "Сімвалы";
"Emoji.Flags" = "Сцягі";


"Chat.DropTitle" = "Перацягніце файлы сюды, каб даслаць іх";
"Chat.DropQuickDesc" = "хуткім шляхам";
"Chat.DropAsFilesDesc" = "без сціскання";

"Message.ActionsPanel.Delete" = "Выдаліць";
"Message.ActionsPanel.Forward" = "Перадаслаць";
"Message.ActionsPanel.EmptySelected" = "Абраць паведамленні";


/* do not translate key with 'countable' suffix */
"Message.ActionsPanel.SelectedCount_countable" = "%d";
"Message.ActionsPanel.SelectedCount_zero" = "абрана %d паведамленняў";
"Message.ActionsPanel.SelectedCount_one" = "абрана %d паведамленне";
"Message.ActionsPanel.SelectedCount_two" = "абрана %d паведамленняў";
"Message.ActionsPanel.SelectedCount_few" = "абрана %d паведамленняў";
"Message.ActionsPanel.SelectedCount_many" = "абрана %d паведамленняў";
"Message.ActionsPanel.SelectedCount_other" = "абрана %d паведамленняў";


/* do not translate key with 'countable' suffix */
"Message.AccessoryPanel.Forwarded_countable" = "%d";
"Message.AccessoryPanel.Forwarded_zero" = "%d перадасланых паведамленняў";
"Message.AccessoryPanel.Forwarded_one" = "%d перадасланае паведамленне";
"Message.AccessoryPanel.Forwarded_two" = "%d перадасланых паведамленняў";
"Message.AccessoryPanel.Forwarded_few" = "%d перадасланых паведамленняў";
"Message.AccessoryPanel.Forwarded_many" = "%d перадасланых паведамленняў";
"Message.AccessoryPanel.Forwarded_other" = "%d перадасланых паведамленняў";



/* do not translate key with 'countable' suffix */
"ForwardModalAction.Title_countable" = "%d";
"ForwardModalAction.Title_zero" = "Перадасланыя паведамленні";
"ForwardModalAction.Title_one" = "Перадасланае паведамленне";
"ForwardModalAction.Title_two" = "Перадасланыя паведамленні";
"ForwardModalAction.Title_few" = "Перадасланыя паведамленні";
"ForwardModalAction.Title_many" = "Перадасланыя паведамленні";
"ForwardModalAction.Title_other" = "Перадасланыя паведамленні";


/*
 _zero
 _one
 _two
 _few
 _many
 _other
 */

/* do not translate key with 'countable' suffix */
"ForwardModalAction.description_countable" = "%d %@";
"ForwardModalAction.description_zero" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленні ад %@";
"ForwardModalAction.description_one" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленне ад %@";
"ForwardModalAction.description_two" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленні ад %@";
"ForwardModalAction.description_few" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленні ад %@";
"ForwardModalAction.description_many" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленні ад %@";
"ForwardModalAction.description_other" = "Абярыце карыстальніка або размову, каб перадаслаць туды паведамленні ад %@";

"ModalAction.ShareContact" = "Падзяліцца кантактам";

"Alert.OK" = "Добра";
"Alert.Cancel" = "Скасаваць";



/* do not translate key with 'countable' suffix */
"Alert.Pasteboard.SendMultiple_countable" = "%d";
"Alert.Pasteboard.SendMultiple_zero" = "Жадаеце даслаць файлы (%d) з буфера?";
"Alert.Pasteboard.SendMultiple_one" = "Жадаеце даслаць %d файл з буфера?";
"Alert.Pasteboard.SendMultiple_two" = "Жадаеце даслаць файлы (%d) з буфера?";
"Alert.Pasteboard.SendMultiple_few" = "Жадаеце даслаць файлы (%d) з буфера?";
"Alert.Pasteboard.SendMultiple_many" = "Жадаеце даслаць файлы (%d) з буфера?";
"Alert.Pasteboard.SendMultiple_other" = "Жадаеце даслаць файлы (%d) з буфера?";

"Alert.Forward.Error" = "Не атрымалася перадаслаць паведамленне ў гэтую размову.";

"Alert.Pasteboard.SendMultiple.Desc" = "Вы заўсёды можаце даслаць файлы і выявы, скапіяваўшы іх ў размову Тэлеграма.";

"PreviewSender.CompressFile" = "Даслаць сціснута";
"PreviderSender.CaptionPlaceholder" = "Подпіс...";
"PreviderSender.CommentPlaceholder" = "Каментар...";
"Modal.Send" = "Даслаць";
"Modal.Share" = "Падзяліцца";
"Modal.CopyLink" = "Скапіяваць спасылку";
"Modal.Cancel" = "Скасаваць";
"Modal.OK" = "Добра";

"QuickLook.Preview" = "Перадпрагляд";


"Chat.Service.You" = "Вы";
"Chat.Service.Group.Created" = "%@ стварыў суполку \"%@\"";
"Chat.Service.Group.AddedMembers" = "%@ запрасіў %@";
"Chat.Service.Group.AddedSelf" = "%@ далучыўся(-лася) да суполкі";
"Chat.Service.Group.RemovedMembers" = "%@ прагнаў(-ла) %@";
"Chat.Service.Group.RemovedSelf" = "%@ выйшаў(-ла) з суполкі";
"Chat.Service.Group.UpdatedPhoto" = "%@ абнавіў(-ла) выяву суполкі";
"Chat.Service.Group.RemovedPhoto" = "%@ выдаліў(-ла) выяву суполкі";
"Chat.Service.Group.UpdatedTitle" = "%@ змяніў(-ла) назву суполкі на \"%@\"";
"Chat.Service.Group.UpdatedPinnedMessage" = "%@ замацаваў(-ла) \"%@\"";
"Chat.Service.Group.RemovedPinnedMessage" = "%@ адмацаваў(-ла) паведамленне";
"Chat.Service.Group.JoinedByLink" = "%@ далучыўся(-лася) да суполкі праз спасылку-запрашэнне";
"Chat.Service.Group.MigratedToSupergroup" = "Гэтая суполка была ператворана ў суперсуполку";
"Chat.Service.Group.TookScreenshot" = "%@ зрабіў(-ла) здымак экрана!";
"Chat.Service.PinnedMessage" = "замацаванае паведамленне";

"Chat.Service.Channel.UpdatedPhoto" = "выява канала абноўленая";
"Chat.Service.Channel.RemovedPhoto" = "выява канала выдаленая";
"Chat.Service.Channel.UpdatedTitle" = "назва канала зменена на \"%@\"";


"Chat.Service.SecretChat.SetTimer" = "%@ усталяваў(-ла) таймер самазнішчэння на %@";
"Chat.Service.SecretChat.SetTimer.Self" = "Вы ўсталявалі таймер самазнішчэння на %@";
"Chat.Service.SecretChat.DisabledTimer" = "%@ адключыў (-ла) таймер самазнішчэння";
"Chat.Service.SecretChat.DisabledTimer.Self" = "Вы адключылі таймер самазнішчэння";

"Chat.Input.Mute" = "Адключыць апавяшчэнні";
"Chat.Input.Unmute" = "Уключыць апавяшчэнні";
"Chat.Input.Return" = "Вярнуцца ў суполку";
"Chat.Input.ExchangingKeys" = "Абмен ключамі шыфравання";
"Chat.Input.SecretChat.WaitingToOnline" = "Чакаем, калі карыстальнік з’явіцца ў сетцы...";
"Chat.Input.Delete" = "Выдаліць і выйсці";
"Chat.Input.Join" = "Далучыцца";
"Chat.Input.Unblock" = "Разблакаваць";

"Message.Context.Reply" = "Адказаць (пстрыкніце двойчы)";
"Message.Context.Forward" = "Перадаслаць";
"Message.Context.Delete" = "Выдаліць";
"Message.Context.Select" = "Абраць";
"Message.Context.Edit" = "Рэдагаваць";
"Message.Context.Goto" = "Паказаць паведамленне";
"Message.Context.Pin" = "Замацаваць";
"Message.Context.Confirm.Pin" = "Замацаваць гэтае паведамленне і паведаміць усіх удзельнікаў суполкі?";
"Message.Context.Confirm.OnlyPin" = "Толькі замацаваць";
"Message.Context.ForwardToCloud" = "Захаваць у воблачнае сховішча";

"Entertainment.Switch.GifAndStickers" = "Налепкі і анімацыі";
"Entertainment.Switch.Emoji" = "Эмодзі";
"Telegram.LayoutAccountController" = "Уліковы запіс";

"AccountSettings.SetProfilePhoto" = "Змяніць выяву профілю";
"AccountSettings.General" = "Агульныя";
"AccountSettings.Stickers" = "Налепкі";
"AccountSettings.Notifications" = "Апавяшчэнні";
"AccountSettings.Username" = "Мянушка";
"AccountSettings.Language" = "Мова";
"AccountSettings.PhoneNumber" = "Нумар тэлефону";
"AccountSettings.PrivacyAndSecurity" = "Прыватнасць і бяспека";
"AccountSettings.Accounts" = "Кіраванне ўліковым запісам";

"AccountSettings.About" = "Звесткі";
"AccountSettings.FAQ" = "ЧаПы Тэлеграма";
"AccountSettings.AskQuestion" = "Спытацца";

"ConnectingStatus.connecting" = "злучэнне";
"ConnectingStatus.online" = "тут";
"ConnectingStatus.updating" = "абнаўленне";
"ConnectingStatus.waitingNetwork" = "чаканне сувязі";
"ConnectingStatus.connectingToProxy" = "злучэнне з проксі-серверам...";

"Chat.ConnectingStatus.connecting" = "Злучэнне";
"Chat.ConnectingStatus.updating" = "Абнаўленне";
"Chat.ConnectingStatus.waitingNetwork" = "Чаканне сувязі";
"Chat.ConnectingStatus.connectingToProxy" = "злучэнне з проксі-серверам";

"InputAttach.Popover.PhotoOrVideo" = "Выява ці відэа";
"InputAttach.Popover.Picture" = "Выява";
"InputAttach.Popover.File" = "Файл";
"InputAttach.Popover.Location" = "Месцазнаходжанне";

"Compose.Popover.NewGroup" = "Новая суполка";
"Compose.Popover.NewChannel" = "Новы канал";
"Compose.Popover.NewSecretChat" = "Новая сакрэтная размова";


"Chat.Cancel" = "Скасаваць";
"Gallery.Context.SaveAs" = "Захаваць як…";
"Gallery.Context.ShowMessage" = "Паказаць паведамленне";
"Gallery.Context.CopyToClipboard" = "Скапіяваць у буфер";


"Chat.Input.Accessory.EditMessage" = "Рэдагаваць паведамленне";
"Chat.Message.edited" = "зменена";

"PeerMedia.Popover.SharedMedia" = "Агульныя медыя";
"PeerMedia.Popover.SharedFiles" = "Агульныя файлы";
"PeerMedia.Popover.SharedLinks" = "Агульныя спасылкі";
"PeerMedia.Popover.SharedAudio" = "Агульныя аўдыязапісы";
"Chat.Message.Via" = "цераз";

"Audio.UnknownArtist" = "Невядомы выканавец";
"Audio.UntitledSong" = "Без назвы";

"AudioController.voiceMessage" = "аўдыязапіс";
"AudioController.videoMessage" = "відэазапіс";
"You" = "Вы";


"Login.WelcomeDescription" = "Вітаем у афіцыйнай прыладзе Тэлеграма для macOS!";
"Login.countryLabel" = "краіна";
"Login.phoneFieldPlaceholder" = "нумар тэлефона";
"Login.Next" = "Далей";

"Login.InvalidCountryCode" = "Памылковы код краіны";
"Login.codePlaceholder" = "код";


"Login.EnterCodeFromApp" = "Калі ласка, увядзіце код, які вы атрымалі ў вашай праграме Тэлеграма на іншым устройстве.";
"Login.SendSmsIfNotReceivedAppCode" = "Не атрымалі код?";
"Login.JustSentSms" = "Мы даслалі SMS з кодам актывацыі на ваш тэлефон. Калі ласка, увядзіце яго.";
"Login.PhoneCalledCode" = "Мы тэлефануем вам на ваш нумар, каб прадыктаваць код.\nКалі ласка, увядзіце яго ніжэй.";
"Login.PhoneDialed" = "Тэлеграм набраў ваш нумар";
"Login.willCall" = "Мы патэлефануем вам праз %d:%@";
"Login.willSendSms" = "Мы дашлем вам SMS праз %d:%@";
"Login.passwordPlaceholder" = "пароль";
"Login.StartMessaging" = "Пачаць перапісвацца";

"Login.EnterPasswordDescription" = "Двухкрокавая верыфікацыя ўключаная. Ваш уліковы запіс абаронены дадатковым паролем.";
"Login.forgotPassword" = "Забыліся на пароль?";
"Login.RecoveryMailFailed" = "Так як вы не пакінулі адрас электроннае пошты, калі пазначалі свой пароль, вам застаецца толькі ўзгадаць пароль альбо скінуць свой уліковы запіс.";

"Login.ResetAccount" = "СКІНУЦЬ МОЙ УЛІКОВЫ ЗАПІС";
"Login.ResetAccountDescription" = "Вы страціце ўсе свае размовы і паведамленні, а таксама ўсё медыя і ўсе файлы, якімі дзяліліся, калі працягнеце.";
"Login.ResetAccount" = "СКІНУЦЬ МОЙ УЛІКОВЫ ЗАПІС";

"PHONE_NUMBER_INVALID" = "Памылковы нумар тэлефона";
"Login.FloodWait" = "занадта шмат спробаў, калі ласка, паспрабуйце пазней";
"PHONE_CODE_INVALID" = "памылковы код";
"PHONE_CODE_EXPIRED" = "пратэрмінаваны код";
"PASSWORD_HASH_INVALID" = "Памылковы пароль";



"Chat.ForwardActionHeader" = "Перадаслаць паведамленні";
"AudioRecord.ReleaseOut" = "Адвядзіце курсор і адпусціце, каб скасаваць";


"GeneralSettings.LargeFonts" = "Вялікія шрыфты ў паведамленнях";
"GeneralSettings.MutedChatsInUnread" = "Улічваць непрачытанае у сцішаных суполках";
"GeneralSettings.MediaKeysForInAppPlayer" = "Апрацоўваць значэнні медыя для ўнутранага прайгравальніка";
"GeneralSettings.EmojiSidebar" = "Бакавая панэль налепак/эмодзі";
"GeneralSettings.ContactsJoined" = "Кантакт далучыўся да Тэлеграма";
"GeneralSettings.DownloadSettings" = "Спампаваць налады";
"GeneralSettings.EmojiReplacements" = "Аўтазамена эмодзі (\"<3\" ➞ ❤️)";
"GeneralSettings.InputSettings" = "НАЛАДЫ ЎВОДУ";
"GeneralSettings.GeneralSettings" = "АГУЛЬНЫЯ НАЛАДЫ";

"GeneralSettings.SendByEnter" = "Дасылаць па Enter";
"GeneralSettings.SendByCmdEnter" = "Дасылаць па ⌘ + Enter";

"Telegram.GeneralSettingsViewController" = "Агульныя налады";
"AccountSettings.Logout" = "Выйсці";
"NotificationSettings.ToggleNotifications" = "Апавяшчэнні";
"NotificationSettings.MessagesPreview" = "Перадпрагляд паведамленняў";
"NotificationSettings.NotificationTone" = "Гук апавяшчэнняў";
"NotificationSettings.ResetNotifications" = "Скінуць апавяшчэнні";
"NotificationSettings.ResetNotificationsText" = "Вы можаце прызначыць асабістыя налады апавяшчэнняў для карыстальнікаў і суполак ніжэй.";
"Telegram.NotificationSettingsViewController" = "Апавяшчэнні";
"AccountSettings.Storage" = "Сховішча";
"DefaultSoundName" = "Па змаўчанні";
"NotificationSettings.Tone.Default" = "Па змаўчанні";
"NotificationSettingsToneNone" = "Няма";

"NotificationSettings.Confirm.Reset" = "Скінуць апавяшчэнні";

"Weekday.Friday" = "Пятніца";
"Weekday.Monday" = "Панядзелак";
"Weekday.Saturday" = "Субота";
"Weekday.ShortFriday" = "Пт";
"Weekday.ShortMonday" = "Пн";
"Weekday.ShortSaturday" = "Сб";
"Weekday.ShortSunday" = "Нд";
"Weekday.ShortThursday" = "Чц";
"Weekday.ShortTuesday" = "Аў";
"Weekday.ShortWednesday" = "Ср";
"Weekday.Sunday" = "Нядзеля";
"Weekday.Thursday" = "Чацвер";
"Weekday.Tuesday" = "Аўторак";
"Weekday.Wednesday" = "Серада";

"Time.at" = "а";
"Time.last_seen" = "быў(-ла) тут";
"Time.today" = "сёння";
"Time.tomorrow" = "заўтра";
"Time.yesterday" = "учора";


"Chat.EmptyChat" = "Пакуль тут няма паведамленняў...";

"Chat.List.Sticker" = "%@ Налепка";
"Chat.List.Voice" = "Аўдыязапіс";
"Chat.List.InstantVideo" = "Відэазапіс";
"Chat.List.Video" = "Відэазапіс";
"Chat.List.Photo" = "Выява";
"Chat.List.GIF" = "Анімацыя";
"Chat.List.File" = "Файл";
"Chat.List.Map" = "Месцазнаходжанне";
"Chat.List.Contact" = "Кантакт";

"UsernameSettings.ChangeDescription" = "Вы можаце абраць мянушку ў Тэлеграме. Калі вы зробіце гэтак, іншыя карыстальнікі змогуць знайсці вас па ёй і звязацца з вамі, не выкарыстоўвая нумар тэлефону.\n\nВы можаце выкарыстоўваць a-z, 0-9 і ніжняе падкрэсліванне. Мінімальная даўжыня — 5 сімвалаў.";
"UsernameSettings.InputPlaceholder" = "Увядзіце вашую мянушку";
"Telegram.UsernameSettingsViewController" = "Мянушка";
"UsernameSettings.available" = "%@ даступная.";

"Error.Username.UnderscopeStart" = "Прабачце, але мянушка не можа пачынацца з ніжняга падкрэслівання.";
"Error.Username.UnderscopeEnd" = "Прабачце, але мянушка не можа сканчацца ніжнім падкрэсліваннем.";
"Error.Username.NumberStart" = "Прабачце, але мянушка не можа пачынацца з лічбы.";
"Error.Username.Invalid" = "Вы не можаце выкарыстаць гэтую мянушку.";
"Error.Username.MinimumLength" = "Мянушка павінна складацца сама менш з 5 сімвалаў.";
"Error.Username.MaximumLength" = "Мянушка не павінна быць даўжэйшай за 32 сімвалы.";
"Error.Username.AlreadyTaken" = "Прабачце, але гэтая мянушка ўжо занятая.";
"UsernameSettings.Done" = "Гатова";

"Search.Separator.ChatsAndContacts" = "кантакты і размовы";
"Search.Separator.GlobalPeers" = "глабальны пошук";
"Search.Separator.Messages" = "паведамленняў";
"Search.Separator.Recent" = "Нядаўнія";
"Search.Separator.Popular" = "Людзі";
"PeerInfo.AdminLabel" = "кіраўнік";
"Share.Link.Copied" = "Скапіявана ў буфер";


"Presence.bot" = "бот";
"Presence.offline" = "не тут";
"CreateGroup.NameHolder" = "Назва суполкі";
"Telegram.ChannelIntroViewController" = "Канал";
"Channel.IntroDescriptionHeader" = "Што такое «канал»?";
"Channel.IntroDescription" = "Каналы – спосаб дасылаць свае паведамленні неабмежавана вялікай аўдыторыі.";
"Channel.Create" = "Стварыць";
"Channel.NewChannel" = "Новы канал";
"Group.CreateGroup" = "Новая суполка";
"Compose.Create" = "Стварыць";
"Compose.Next" = "Далей";
"Channel.ChannelNameHolder" = "Назва канала";
"Channel.DescriptionHolder" = "Апісанне";
"Channel.DescriptionHolderDescrpiton" = "Вы можаце пакінуць дадатковае апісанне свайго канала.";
"Channel.Channel" = "Канал";


"Channel.TypeHeaderChannel" = "ТЫП КАНАЛА";
"Channel.TypeHeaderGroup" = "ТЫП СУПОЛКІ";


"Channel.Public" = "Публічны";
"Channel.Private" = "Прыватны";


"Channel.PrivateAboutChannel" = "Да прыватных каналаў можна далучыцца толькі праз спасылку-запрашэнне.";
"Channel.PublicAboutChannel" = "Публічныя каналы могуць быць знойдзеныя праз пошук, і кожны карыстальнік можа да іх далучыцца.";
"Channel.PrivateAboutGroup" = "Да прыватных суполак можна далучыцца толькі праз спасылку-запрашэнне.";
"Channel.PublicAboutGroup" = "Публічныя суполкі могуць быць знойдзеныя праз пошук, і кожны карыстальнік можа да іх далучыцца.";

"Channel.PublicNamesLimitError" = "Выбачайце, але вы занялі зашмат публічных мянушак. Вы можаце абнуліць адну з мянушак з вашых старых суполак ці каналаў.";


"Channel.ExportLinkAboutChannel" = "Карыстальнікі могуць далучыцца да вашага каналу, калі пяройдуць па гэтай спасылцы. Вы можаце змяніць ці выключыць гэтую спасылку ў любы момант.";
"Channel.ExportLinkAboutGroup" = "Карыстальнікі могуць далучыцца да вашае суполкі, калі пяройдуць па гэтай спасылцы. Вы можаце змяніць ці выключыць гэтую спасылку ў любы момант.";
"Channel.UsernameAboutChannel" = "Карыстальнікі могуць дзяліцца гэтай спасылкай з іншымі і знайсці ваш канал праз пошук Тэлеграму.";
"Channel.UsernameAboutGroup" = "Карыстальнікі могуць дзяліцца гэтай спасылкай з іншымі і знайсці вашу суполку праз пошук Тэлеграму.";


"Group.NewGroup" = "Новая суполка";

"Chat.Confirm.ActionUndonable" = "Гэтае дзеянне немагчыма скасаваць.";
"Chat.Confirm.DeleteMessages" = "Выдаліць абраныя паведамленні?";
"Chat.Confirm.DeleteMessagesForEveryone" = "Выдаліць для ўсіх";

"Telegram.PrivacyAndSecurityViewController" = "Прыватнасць і бяспека";
"PrivacySettings.PrivacyHeader" = "ПРЫВАТНАСЦЬ";
"PrivacySettings.BlockedUsers" = "Заблакаваныя карыстальнікі";
"PrivacySettings.LastSeen" = "Апошняя актыўнасць";
"PrivacySettings.Groups" = "Суполкі";
"PrivacySettings.VoiceCalls" = "Галасавыя выклікі";
"PrivacySettings.SecurityHeader" = "БЯСПЕКА";
"PrivacySettings.Passcode" = "Код";
"PrivacySettings.ActiveSessions" = "Актыўныя сэсіі";

"PrivacySettings.UseProxy" = "Ужыць проксі";
"PrivacySettings.ProxyHeader" = "ТЫП ЗЛУЧЭННЯ";

"PrivacySettings.DeleteAccountHeader" = "ВЫДАЛІЦЬ МОЙ УЛІКОВЫ ЗАПІС";
"PrivacySettings.DeleteAccount" = "Перыяд неактыўнасці";
"PrivacySettings.DeleteAccountDescription" = "Калі вы не заходзілі сама менш аднойчы за гэты перыяд, ваш уліковы запіс будзе аўтаматычна выдалены, разам з усімі суполкамі, паведамленнямі і кантактамі.";
"PrivacySettings.TwoStepVerification" = "Двухкрокавая верыфікацыя";

"Telegram.PasscodeSettingsViewController" = "Код";
"Passcode.Placeholder" = "код";
"Passcode.LogoutDescription" = "Калі вы забыліся на код, вы можаце";
"Passcode.LogoutLinkText" = "выйсці";




"PreviewSender.SendFiles_countable" = "%d";
"PreviewSender.SendFiles_zero" = "абрана %d файлаў";
"PreviewSender.SendFiles_one" = "абраны %d файл";
"PreviewSender.SendFiles_two" = "абрана %d файлаў";
"PreviewSender.SendFiles_few" = "абрана %d файлаў";
"PreviewSender.SendFiles_many" = "абрана %d файлаў";
"PreviewSender.SendFiles_other" = "абрана %d файлаў";


"PreviewSender.SendImages_countable" = "%d";
"PreviewSender.SendImages_zero" = "абрана %d выяў";
"PreviewSender.SendImages_one" = "абраная %d выява";
"PreviewSender.SendImages_two" = "абрана %d выяў";
"PreviewSender.SendImages_few" = "абрана %d выяў";
"PreviewSender.SendImages_many" = "абрана %d выяў";
"PreviewSender.SendImages_other" = "абрана %d выяў";

"PreviewSender.SendVideos_countable" = "%d";
"PreviewSender.SendVideos_zero" = "абрана %d відэафайлаў";
"PreviewSender.SendVideos_one" = "абраны %d відэафайл";
"PreviewSender.SendVideos_two" = "абрана %d відэафайлаў";
"PreviewSender.SendVideos_few" = "абрана %d відэафайлаў";
"PreviewSender.SendVideos_many" = "абрана %d відэафайлаў";
"PreviewSender.SendVideos_other" = "абрана %d відэафайлаў";


"PreviewSender.SendMediaFiles_countable" = "%d";
"PreviewSender.SendMediaFiles_zero" = "абрана %d файлаў";
"PreviewSender.SendMediaFiles_one" = "абраны %d файл";
"PreviewSender.SendMediaFiles_two" = "абрана %d файлаў";
"PreviewSender.SendMediaFiles_few" = "абрана %d файлаў";
"PreviewSender.SendMediaFiles_many" = "абрана %d файлаў";
"PreviewSender.SendMediaFiles_other" = "абрана %d файлаў";


"PreviewSender.ExpandItems" = "Разгарнуць";
"Chat.Input.StartBot" = "Пачаць";

"InlineModalAction.Title" = "Падзяліцца змесцівам бота";
"InlineModalAction.Desc" = "Абярыце карыстальніка або размову, каб падзяліцца змесцівам цераз %@";

"Telegram.PasswordViewController" = "Двухкрокавая верыфікацыя";


"ChatList.Context.StopBot" = "Спыніць бота";
"ChatList.Context.Unmute" = "Уключыць апавяшчэнні";
"ChatList.Context.Mute" = "Адключыць апавяшчэнні";
"ChatList.Context.Block" = "Заблакаваць карыстальніка";
"ChatList.Context.ClearHistory" = "Ачысціць гісторыю";
"ChatList.Context.Call" = "Выклік";
"ChatList.Context.DeleteChat" = "Выдаліць размову";
"ChatList.Context.DeleteAndExit" = "Выдаліць і выйсці";
"ChatList.Context.LeaveChannel" = "Выйсці з канала";
"ChatList.Context.LeaveGroup" = "Выйсці з суполкі";
"ChatList.Context.ReturnGroup" = "Вярнуцца ў суполку";
"ChatList.Context.Pin" = "Замацаваць";
"ChatList.Context.Unpin" = "Адмацаваць";

"ChatList.SecretChat.Terminated" = "Сакрэтная размова скасаваная";
"ChatList.SecretChat.Joined" = "%@ далучыўся(-лася) да вашай сакрэтнай размовы.";
"ChatList.SecretChat.Created" = "%@ стварыў(-ла) сакрэтную размову";
"ChatList.SecretChat.ExKeys" = "Чакаем, калі карыстальнік з’явіцца ў сетцы...";

"ChatList.UnsupportedMessage" = "Паведамленне не падтрымліваецца";
"Chat.Message.Unsupported" = "Гэтае паведамленне не падтрымліваецца вашай версіяй Тэлеграма. Вы можаце абнавіць праграму ў наладах альбо спампаваць яе адсюль: https://macos.telegram.org";
"Text.Copy" = "Скапіяваць";


"Peer.Activity.User.TypingText" = "піша";
"Peer.Activity.User.SendingPhoto" = "адпраўляе выяву";
"Peer.Activity.User.RecordingVideo" = "робіць відэазапіс";
"Peer.Activity.User.SendingVideo" = "адпраўляе відэафайл";
"Peer.Activity.User.RecordingAudio" = "робіць аўдыязапіс";
"Peer.Activity.User.SendingAudio" = "адпраўляе аўдыяфайл";
"Peer.Activity.User.SendingFile" = "адпраўляе файл";
"Peer.Activity.User.PlayingGame" = "гуляе ў гульню";


"Peer.Activity.Chat.Single.TypingText" = "%@ піша";
"Peer.Activity.Chat.Single.SendingPhoto" = "%@ адпраўляе выяву";
"Peer.Activity.Chat.Single.RecordingVideo" = "%@ робіць аўдыязапіс";
"Peer.Activity.Chat.Single.SendingVideo" = "%@ адпраўляе відэафайл";
"Peer.Activity.Chat.Single.RecordingAudio" = "%@ робіць відэазапіс";
"Peer.Activity.Chat.Single.SendingAudio" = "%@ адпраўляе аўдыяфайл";
"Peer.Activity.Chat.Single.SendingFile" = "%@ адпраўляе файл";
"Peer.Activity.Chat.Single.PlayingGame" = "%@ гуляе ў гульню";


"Peer.Activity.Chat.Multi.TypingText" = "%d пішуць";
"Peer.Activity.Chat.Multi.SendingPhoto" = "%d адпраўляюць выяву";
"Peer.Activity.Chat.Multi.RecordingVideo" = "%d робяць відэазапіс";
"Peer.Activity.Chat.Multi.SendingVideo" = "%d адпраўляюць відэафайл";
"Peer.Activity.Chat.Multi.RecordingAudio" = "%d робяць аўдыязапіс";
"Peer.Activity.Chat.Multi.SendingAudio" = "%d адпраўляюць аўдыяфайл";
"Peer.Activity.Chat.Multi.SendingFile" = "%d адпраўляюць файл";
"Peer.Activity.Chat.Multi.PlayingGame" = "%d гуляюць у гульню";



"Peer.Media.SharedMediaEmptyList" = "Падзяліцеся выявамі і відэа ў гэтай размове, альбо сашчэпачка будзе сумаваць.";
"Peer.Media.SharedFilesEmptyList" = "Вы можаце дасылаць і атрымліваць файлы любога тыпу памерам да 1.5 ГБ і мець да іх доступ адусюль.";
"Peer.Media.SharedLinksEmptyList" = "Усе спасылкі, якімі дзяліліся ўдзельнікі гэтае размовы, будзе паказвацца тут.";
"Peer.Media.SharedMusicEmptyList" = "Уся музыка, якой дзяліліся ўдзельнікі ў гэтай размове, будзе паказвацца тут.";

"SecretTimer.Off" = "Выкл";

"Timer.Seconds_countable" = "%d";
"Timer.Seconds_zero" = "%d с.";
"Timer.Seconds_one" = "%d с.";
"Timer.Seconds_two" = "%d с.";
"Timer.Seconds_few" = "%d с.";
"Timer.Seconds_many" = "%d с.";
"Timer.Seconds_other" = "%d с.";


"Timer.Days_countable" = "%d";
"Timer.Days_zero" = "%d дз.";
"Timer.Days_one" = "%d дз.";
"Timer.Days_two" = "%d дз.";
"Timer.Days_few" = "%d дз.";
"Timer.Days_many" = "%d дз.";
"Timer.Days_other" = "%d дз.";


"Timer.Minutes_countable" = "%d";
"Timer.Minutes_zero" = "%d хв.";
"Timer.Minutes_one" = "%d хв.";
"Timer.Minutes_two" = "%d хв.";
"Timer.Minutes_few" = "%d хв.";
"Timer.Minutes_many" = "%d хв.";
"Timer.Minutes_other" = "%d хв.";

"Timer.Hours_countable" = "%d";
"Timer.Hours_zero" = "%d гдз";
"Timer.Hours_one" = "%d гдз";
"Timer.Hours_two" = "%d гдз";
"Timer.Hours_few" = "%d гдз ";
"Timer.Hours_many" = "%d гдз ";
"Timer.Hours_other" = "%d гдз";


"Timer.Weeks_countable" = "%d";
"Timer.Weeks_zero" = "%d weeks";
"Timer.Weeks_one" = "%d week";
"Timer.Weeks_two" = "%d weeks";
"Timer.Weeks_few" = "%d weeks";
"Timer.Weeks_many" = "%d weeks";
"Timer.Weeks_other" = "%d weeks";

"Timer.Months_countable" = "%d";
"Timer.Months_zero" = "%d months";
"Timer.Months_one" = "%d month";
"Timer.Months_two" = "%d months";
"Timer.Months_few" = "%d months";
"Timer.Months_many" = "%d months";
"Timer.Months_other" = "%d months";

"Timer.Years_countable" = "%d";
"Timer.Years_zero" = "%d years";
"Timer.Years_one" = "%d year";
"Timer.Years_two" = "%d years";
"Timer.Years_few" = "%d years";
"Timer.Years_many" = "%d years";
"Timer.Years_other" = "%d years";

"Timer.Forever" = "Forever";
"ChatList.Draft" = "Draft:";
"ChatList.You" = "You";

"Notification.LockedPreview" = "You have new message";
"JoinLink.Join" = "Join";

"Group.Unavailable" = "Sorry, this group does not seem to exist.";

"Chat.Title.self" = "Your Cloud storage";
"Separator.ShowMore" = "Show More";
"Separator.ShowLess" = "Show Less";
"Stickers.Recent" = "Нядаўнія";
"Account.Confirm.AskQuestion" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while. \n\nPlease take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"Account.Confirm.GoToFaq" = "Open FAQ";

"Chat.SecretChat.EmptyHeader" = "Secret chats:";
"Chat.SecretChat.1Feature" = " - Use end-to-end encryption";
"Chat.SecretChat.2Feature" = " - Leave no trace on our servers";
"Chat.SecretChat.3Feature" = " - Have a self-destruct timer";
"Chat.SecretChat.4Feature" = " - Do not allow forwarding";


"TextView.Transform.Bold" = "Make Bold";
"TextView.Transform.Italic" = "Make Italic";
"TextView.Transform.Code" = "Make Monospace";
"AccountsController.NewAccount" = "New Account";
"Telegram.AccountsListViewController" = "Account Management";

"Account.Confirm.Logout" = "Log out?";
"Account.Confirm.LogoutText" = "Remember, logging out cancels all your Secret Chats.";

"Telegram.ConvertGroupViewController" = "Supergroup";

"Supergroup.Convert.Description" = "**In supergroups:**\n\n• New members can see the full message history\n• Deleted messages will disappear for all members\n• Admins can pin important messages\n• Creator can set a public link for the group";
"Supergroup.Convert.Undone" = "**Note**: This action cannot be undone.";
"Supergroup.Convert.Button" = "Convert to Supergroup";


"PeerInfo.MembersHeader_countable" = "%d";
"PeerInfo.MembersHeader_zero" = "%d MEMBERS";
"PeerInfo.MembersHeader_one" = "%d MEMBER";
"PeerInfo.MembersHeader_two" = "%d MEMBERS";
"PeerInfo.MembersHeader_few" = "%d MEMBERS";
"PeerInfo.MembersHeader_many" = "%d MEMBERS";
"PeerInfo.MembersHeader_other" = "%d MEMBERS";

"PeerInfo.InviteLink" = "Invite Link";
"PeerInfo.Admins" = "Admins";
"PeerInfo.BlackList" = "Blacklist";
"PeerInfo.SetAdmins" = "Set Admins";
"PeerInfo.GroupType" = "Group Type";
"PeerInfo.ChannelType" = "Channel Type";
"PeerInfo.GroupType.Public" = "Public";
"PeerInfo.GroupType.Private" = "Private";
"PeerInfo.SetAboutDescription" = "You can provide an optional description for your group.";
"PeerInfo.About.Placeholder" = "Description";
"PeerInfo.ConvertToSupergroup" = "Convert To Supergroup";

"Telegram.ChannelBlacklistViewController" = "Blacklist";
"Telegram.ChannelAdminsViewController" = "Admins";

"ChannelBlacklist.EmptyDescrpition" = "Blacklisted users are removed from the group and can only come back if invited by an admin. Invite links don't work for them.";

"Admins.GroupAdmins" = "GROUP ADMINS";
"Admins.ChannelAdmins" = "CHANNEL ADMINS";

"Admins.OnlyAdminsCanAddMembers" = "Only Admins can add new members";
"Admins.EverbodyCanAddMembers" = "Everybody can add new members";
"Admins.GroupDescription" = "You can add admins to help you manage your group";
"Admins.ChannelDescription" = "You can add admins to help you manage your channel";
"Admins.SelectNewAdminTitle" = "Contacts";
"Admins.AddPeerAsAdmin" = "Add \"%@\" as admin?";
"Admins.AddAdmin" = "Add Admin";
"Admins.Creator" = "Creator";
"Admins.Admin" = "Admin";
"Admins.Moderator" = "Moderator";
"Admins.WhoCanInvite.Text" = "Who can add members";
"Admins.WhoCanInvite.Admins" = "Only Admins";
"Admins.WhoCanInvite.Everyone" = "All Members";

"Telegram.ChannelVisibilityController" = "Group";
"PeerInfo.Confirm.AddMembers" = "Add %d users to group?";
"PeerInfo.Confirm.AddMember" = "Add \"%@\" to group?";
"PeerInfo.Confirm.RemovePeer" = "Remove \"%@\" from group?";

"PeerInfo.FirstName.Placeholder" = "First Name";
"PeerInfo.LastName.Placeholder" = "Last Name";
"PeerInfo.GroupName.Placeholder" = "Group Name";
"PeerInfo.ChannelName.Placeholder" = "Channel Name";
"PeerInfo.Phone" = "phone";

"ConvertToSupergroup.Alert.Error" = "Something is wrong, please try again later.";
"ConvertToSuperGroup.Confirm" = "Are you sure? This action cannot be undone.";
"Telegram.LinkInvationController" = "Invite Link";

"GroupInvation.CopyLink" = "Copy Link";
"GroupInvation.Revoke" = "Revoke";
"GroupInvation.Share" = "Share Link";

"GroupInvation.GroupDescription" = "Anyone who has Telegram installed will be able to join your group by following this link";
"GroupInvation.ChannelDescription" = "Anyone who has Telegram installed will be able to join your channel by following this link";

"Chat.Header.PinnedMessage" = "Pinned message";
"Chat.Header.ReportSpam" = "Report Spam";
"Chat.Confirm.Unpin" = "Would you like to unpin this message?";

"StickerPack.Add" = "Add %d Stickers";
"Compose.Select.SecretChat" = "Secret Chat";
"Compose.Confirm.StartSecretChat" = "Create secret chat with \"%@\"";
"StickerPack.Remove" = "Remove %d stickers";

"ReportReason.Spam" = "Spam";
"ReportReason.Violence" = "Violence";
"ReportReason.Porno" = "Pornography";
"PeerInfo.ChannelReported" = "Thank You! Your report will be reviewed by our team very soon.";

"PeerInfo.SignMessages.Desc" = "Add names of the admins to the messages they post.";
"PeerInfo.SignMessages" = "Sign Messages";
"PeerInfo.SetChannelPhoto" = "Set Channel Photo";
"PeerInfo.Members" = "Members";
"PeerInfo.ChannelLink" = "Link";
"PeerInfo.DeleteChannel" = "Delete Channel";
"PeerInfo.DeleteSecretChat" = "Delete Secret Chat";

"ChannelMembers.AddMembers" = "Add Members";
"ChannelMembers.InviteLink" = "Invite via Link";
"ChannelMembers.MembersListDesc" = "Only channel admins can see this list.";
"Telegram.ChannelMembersViewController" = "Channel Members";

"LinkInvation.Group.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the group using it.";
"LinkInvation.Channel.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the channel using it.";
"LinkInvation.Confirm.Ok" = "Revoke";
"ChannelMembers.Select.Title" = "Add Members";
"PeerInfo.Confirm.StartSecretChat" = "Are you sure you want to start a secret chat with \"%@\"?";


"PeerInfo.BotStatus.HasNoAccess" = "has no access to messages";
"PeerInfo.BotStatus.HasAccess" = "has access to messages";
"PeerInfo.GroupsInCommon" = "Groups In Common";
"GroupsInCommon.Empty" = "No groups in common";
"Telegram.GroupsInCommonViewController" = "Groups In Common";

"ChannelVisibility.Checking" = "Checking";
"ChannelVisibility.Loading" = "Loading...";
"Peer.DeletedUser" = "Deleted User";

"ChatList.Service.Call.incoming" = "Incoming Call (%@)";
"ChatList.Service.Call.outgoing" = "Outgoing Call (%@)";
"ChatList.Service.Call.Cancelled" = "Cancelled Call";

"ChatList.Service.Call.Missed" = "Missed Call";
"ChatList.Service.Call.busy" = "Busy";
"ChatList.Service.Call.Hangup" = "Hangup";
"ChatList.Service.Call.Disconnected" = "Disconnected";

"ChatList.Service.GameScored" = "scored %d in %@";


"About.Description" = "Free messaging app for macOS based on MTProto for speed and security.";
"ChatService.ChannelCreated" = "channel created";
"Telegram.BlockedPeersViewController" = "Blocked Users";
"BlockedPeers.EmptyDescrpition" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";

"Sessions.CurrentSessionHeader" = "CURRENT SESSION";
"Sessions.TerminateOthers" = "Terminate all other sessions";
"Sessions.TerminateDescription" = "Logs out all devices except for this one.";
"Sessions.ActiveSessionsHeader" = "ACTIVE SESSIONS";


"Passcode.TurnOn" = "Turn Passcode On";
"Passcode.TurnOnDescription" = "When you set up an additional passcode, you can use ⌘ + L for lock.\n\nNote: if you forget the passcode, you'll need to delete and reinstall the app. All secret chats will be lost.";
"Passcode.TurnOff" = "Turn Passcode Off";
"Passcode.Change" = "Change passcode";
"Passcode.Autolock" = "Auto-Lock";
"Passcode.AutoLock.Disabled" = "Disabled";
"Passcode.AutoLock.IfAway" = "If away for %@";

"Passcode.EnterPasscodePlaceholder" = "Enter a passcode";
"Passcode.ReEnterPlaceholder" = "Re-enter a passcode";
"Passcode.EnterCurrentPlaceholder" = "Enter Current Passcode";
"Passcode.EnterNewPlaceholder" = "Enter New Passcode";

"Passcode.Next" = "Next";


"Peer.ServiceNotifications" = "Service Notifications";

"Alert.SendError.Header" = "Your message could not be sent";
"Alert.SendError.Text" = "An error occurred while sending the previous message. Would you like to resend it ?";
"Alert.SendError.Resend" = "Resend";
"Alert.SendError.Delete" = "Delete";
"Alert.SendError.Ignore" = "Ignore";

"GeneralSettings.EnableSidebar" = "Sidebar";
"GeneralSettings.SidebarDescription" = "Stickers and Emoji will appear on the right of chat.";
"Telegram.RecentSessionsController" = "Active Sessions";
"RecentSessions.Confirm.TerminateOthers" = "Are you sure you want to terminate all other sessions?";
"RecentSessions.Confirm.Revoke" = "Do you want to terminate this session?";
"RecentSessions.Revoke" = "Revoke";

"Legacy.Intro.Description1" = "Welcome to the new super-fast and stable Telegram for macOS, fully rewritten in Swift 3.0.";
"Legacy.Intro.Description2" = "Please note that your existing secret chats will be available in read-only mode. You can of course create new ones to continue chatting.";
"Legacy.Intro.Next" = "Start Messaging";

"Messages.ReplyLoading.Header" = "Reply";
"Messages.ReplyLoading.Loading" = "Loading...";
"PeerInfo.DeleteContact" = "Delete Contact";
"PeerInfo.Confirm.DeleteContact" = "Delete Contact?";
"Compose.SelectUsers" = "Select users";
"PeerInfo.AddContact" = "Add Contact";
"Telegram.GroupAdminsController" = "Admins";
"GroupAdmins.AllMembersAdmins" = "All Members Are Admins";
"GroupAdmins.Desc.AdminInvites" = "Only admins can add and remove members, edit name and photo of this group.";
"GroupAdmins.Desc.AllInvites" = "Group members can add new members, edit name and photo of this group.";
"Login.PhoneNumberNotRegistred" = "Phone number not registered. If you don't have a Telegram account yet, please sign up with your mobile device.";
"Login.Unregistred.OpenSite" = "Open Site";
"Login.YourPhoneLabel" = "your phone";
"Login.YourCodeLabel" = "your code";
"Login.YourPasswordLabel" = "your password";

"PeerInfo.EncryptionKey" = "Encryption Key";

"Telegram.SecretChatKeyViewController" = "Encryption Key";
"EncryptionKey.Description" = "This image and text were derived from the encryption key for this secret chat with **%@**.\n\nIf they look the same on %2$@'s device, end-to-end encryption is guaranteed.";


"GeneralSettings.InAppSounds" = "In-App Sounds";
"Chat.ShareInlineResultActionHeader" = "Share";
"Context.CopyMedia" = "Save as...";

"Telegram.InstalledStickerPacksController" = "Stickers";
"Stickers.Set.Count" = "%d stickers";
"Telegram.FeaturedStickerPacksController" = "Trending Stickers";
"Telegram.ArchivedStickerPacksController" = "Archived Stickers";
"ArchivedStickers.Description" = "You can have up to 200 sticker sets installed. Unused stickers are archived when you add more.";
"InstalledStickers.PacksTitle" = "STICKER SETS";
"InstalledStickers.Descrpiption" = "Artists are welcome to add their own sticker sets using our @stickers bot.\n\nTap on a sticker to view and add the whole set.";
"InstalledStickers.Archived" = "Archived Stickers";
"InstalledStickers.Tranding" = "Trending Stickers";
"StickerSet.Remove" = "Remove";
"InstalledStickers.Remove.Description" = "Stickers will be archived, you can quickly restore it later from the Archived Stickers section.";
"InstalledStickers.Remove.Delete" = "Delete";
"InstalledStickers.Remove.Archive" = "Archive";
"Alert.UserDoesntExists" = "Sorry, this user doesn't seem to exist.";
"InAppLinks.Confirm.OpenExternal" = "open %@?";

"Login.Header.Code" = "Enter Code";
"Login.Header.Password" = "Enter Password";
"Login.Header.SignUp" = "Sign Up";
"Telegram.EmptyChatViewController" = "";
"Contacts.AddContact" = "Add Contact";
"Contacts.FirstName.Placeholder" = "First Name";
"Contacts.LastName.Placeholder" = "Last Name";
"Contacts.PhoneNumber.Placeholder" = "Phone Number";
"Contacts.NotRegistredTitle" = "Not Telegram Contact";
"Contacts.NotRegistredDescription" = "This contact is not registered in Telegram yet. You will be able to send them a Telegram message as soon as they sign up.";

"Telegram.DataAndStorageViewController" = "Data And Storage";
"DataAndStorage.StorageUsage" = "Storage Usage";
"DataAndStorage.NetworkUsage" = "Network Usage";


"DataAndStorage.AutomaticDownload.PrivateChats" = "Private Chats";
"DataAndStorage.AutomaticDownload.GroupsChannels" = "Groups and Channels";

"DataAndStorage.AutomaticPhotoDownload.Header" = "AUTOMATIC PHOTO DOWNLOAD";
"DataAndStorage.AutomaticAudioDownload.Header" = "AUTOMATIC AUDIO DOWNLOAD";
"DataAndStorage.AutomaticVideoDownload.Header" = "AUTOMATIC VIDEO DOWNLOAD";


"DataAndStorage.VoiceCalls.Header" = "VOICE CALLS";
"DataAndStorage.VoiceCalls.LessData" = "Use Less Data";
"Telegram.StorageUsageController" = "Storage Usage";
"StorageUsage.KeepMedia" = "Keep Media";
"StorageUsage.KeepMedia.Description" = "Photos, videos and other files from cloud chats that you have **not accessed** during this period will be removed from this device to save disk space.\n\nAll media will stay in the Telegram cloud and can be re-downloaded if you need it again.";
"StorageUsage.ChatsHeader" = "CHATS";
"StorageUsage.Calculating" = "Calculating current cache size...";
"App.MaxFileSize" = "Maximum file size is 1.5 GB";
"Message.Context.SaveGif" = "Add GIF";
"Context.RecentGifRemove" = "Remove";
"Sidebar.Avalability" = "Sidebar available in chat";


"PrivacySettingsController.Header" = "Last Seen";
"PrivacySettingsController.Everbody" = "Everybody";
"PrivacySettingsController.MyContacts" = "My Contacts";
"PrivacySettingsController.Nobody" = "Nobody";
"PrivacySettingsController.NeverShare" = "Never Share";
"PrivacySettingsController.AlwaysShare" = "Always Share";
"PrivacySettingsController.NeverShareWith" = "Never Share With";
"PrivacySettingsController.AlwaysShareWith" = "Always Share With";
"PrivacySettingsController.NeverAllow" = "Never Allow";
"PrivacySettingsController.AlwaysAllow" = "Always Allow";



"PrivacySettingsController.UserCount_countable" = "%d";
"PrivacySettingsController.UserCount_zero" = "%d user";
"PrivacySettingsController.UserCount_one" = "%d user";
"PrivacySettingsController.UserCount_two" = "%d users";
"PrivacySettingsController.UserCount_few" = "%d users";
"PrivacySettingsController.UserCount_many" = "%d users";
"PrivacySettingsController.UserCount_other" = "%d users";

"PrivacySettingsController.AddUsers" = "Add Users";

"PrivacySettingsController.LastSeenHeader" = "WHO CAN SEE MY TIMESTAMP";
"PrivacySettingsController.LastSeenDescription" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";

"PrivacySettingsController.GroupHeader" = "WHO CAN ADD ME TO GROUP CHATS";
"PrivacySettingsController.GroupDescription" = "You can restrict who can add you to groups and channels with granular precision.";

"PrivacySettingsController.PhoneCallHeader" = "WHO CAN CALL ME";
"PrivacySettingsController.PhoneCallDescription" = "You can restrict who can call you with granular precision.";
"PrivacySettingsController.PeerInfo" = "These settings will override the values above.";

"Chat.Call.Outgoing" = "Outgoing Call";
"Chat.Call.Incoming" = "Incoming Call";

"CallHeader.ShowCallInfo" = "Show Call Info";
"CallHeader.EndCall" = "End Call";
"Call.ParticipantVersionOutdatedError" = "%@'s app does not support calls. They need to update their app before you can call them.";
"Call.UndefinedError" = "Undefined Error, please try later.";
"Call.PrivacyErrorMessage" = "Sorry, %@ doesn't accept calls.";

"Call.StatusRequesting" = "Contacting...";
"Call.StatusWaiting" = "Waiting...";
"Call.StatusRinging" = "Ringing...";
"Call.StatusConnecting" = "Connecting...";
"Call.StatusEnded" = "Call Ended";
"Call.StatusFailed" = "Call Failed";
"Call.StatusBusy" = "Busy";
"Call.StatusCalling" = "is calling you...";

"Call.Accept" = "Accept";
"Call.Decline" = "Decline";

"Call.Recent.Outgoing" = "Outgoing";
"Call.Recent.Incoming" = "Incoming";
"Call.Recent.Missed" = "Missed";


"Call.Seconds_countable" = "%d";
"Call.Seconds_zero" = "%d second";
"Call.Seconds_one" = "%d second";
"Call.Seconds_two" = "%d seconds";
"Call.Seconds_few" = "%d seconds";
"Call.Seconds_many" = "%d seconds";
"Call.Seconds_other" = "%d seconds";

"Call.Minutes_countable" = "%d";
"Call.Minutes_zero" = "%d minute";
"Call.Minutes_one" = "%d minute";
"Call.Minutes_two" = "%d minutes";
"Call.Minutes_few" = "%d minutes";
"Call.Minutes_many" = "%d minutes";
"Call.Minutes_other" = "%d minutes";

"Call.ShortSeconds_countable" = "%d";
"Call.ShortSeconds_zero" = "%d sec";
"Call.ShortSeconds_one" = "%d sec";
"Call.ShortSeconds_two" = "%d sec";
"Call.ShortSeconds_few" = "%d sec";
"Call.ShortSeconds_many" = "%d sec";
"Call.ShortSeconds_other" = "%d sec";

"Call.ShortMinutes_countable" = "%d";
"Call.ShortMinutes_zero" = "%d min";
"Call.ShortMinutes_one" = "%d min";
"Call.ShortMinutes_two" = "%d min";
"Call.ShortMinutes_few" = "%d min";
"Call.ShortMinutes_many" = "%d min";
"Call.ShortMinutes_other" = "%d min";


"Telegram.LayoutPhoneCallsViewController" = "Recent Calls";
"RecentCalls.Empty" = "Your recent calls will appear here";

"Call.Confirm.DiscardCurrent.Header" = "Call in Progress";
"Call.Confirm.DiscardCurrent.Description" = "Finish call with %@ and start a new one with %@?";
"Call.RatingModal.Placeholder" = "Leave comment...";
"QuickSwitcher.Recently" = "Recent";
"QuickSwitcher.Popular" = "Popular";
"QuickSwitcher.Description" = "**tab** or **↑ ↓** to navigate, **⮐** to select, **esc** to dismiss";

"Chat.Context.Edit" = "Edit (click on date)";
"Chat.Context.EnableNotifications" = "Enable Notifications";
"Chat.Context.DisableNotifications" = "Disable Notifications";
"Chat.Context.ClearHistory" = "Clear History";

"Call.DeviceSettings.Default" = "Same as System";
"Call.DeviceSettings.InputLabel" = "Microphone:";
"Call.DeviceSettings.OutputLabel" = "Speakers:";
"Payments.Unsupported" = "Sorry, Telegram Mac doesn't support payments yet. Please use one of our mobile apps to do this.";

"Chat.Service.PaymentSent" = "You have just successfully transferred **%@** to **%@** for **%@**";
"Chat.List.Service.PaymentSent" = "Payment: %@";

"Telegram.LanguageViewController" = "Language";



"Chat.LoadingMessages" = "Loading messages";


"1Xt-HY-uBw.title" = "Telegram";
"1b7-l0-nxx.title" = "Find";
"2oI-Rn-ZJC.title" = "Transformations";
"3IN-sU-3Bg.title" = "Spelling";
"3rS-ZA-NoH.title" = "Speech";
"4EN-yA-p0u.title" = "Find";
"4J7-dP-txa.title" = "Enter Full Screen";
"4sb-4s-VLi.title" = "Quit Telegram";
"5QF-Oa-p0T.title" = "Edit";
"_NS:88.title" = "Edit";
"5kV-Vb-QxS.title" = "About Telegram";
"6dh-zS-Vam.title" = "Redo";
"78Y-hA-62v.title" = "Correct Spelling Automatically";
"9ic-FL-obx.title" = "Substitutions";
"9yt-4B-nSM.title" = "Smart Copy/Paste";
"AYu-sK-qS6.title" = "Main Menu";
"BOF-NM-1cW.title" = "Preferences…";
"Cag-YX-WT6.title" = "Hide Telegram";
"Dv1-io-Yv7.title" = "Spelling and Grammar";
"F2S-fz-NVQ.title" = "Help";
"FKE-Sm-Kum.title" = "TelegramMac Help";
"FeM-D8-WVr.title" = "Substitutions";
"H8h-7b-M4v.title" = "View";
"_NS:70.title" = "View";
"HFQ-gK-NFA.title" = "Text Replacement";
"HFo-cy-zxI.title" = "Show Spelling and Grammar";
"HyV-fh-RgO.title" = "View";
"Kd2-mp-pUS.title" = "Show All";
"LE2-aR-0XJ.title" = "Bring All to Front";
"NMo-om-nkz.title" = "Services";
"OY7-WF-poV.title" = "Minimize";
"Olw-nP-bQN.title" = "Hide";
"OwM-mh-QMV.title" = "Find Previous";
"Oyz-dy-DGm.title" = "Stop Speaking";
"QvC-M9-y7g.title" = "Telegram";
"R4o-n2-Eq4.title" = "Zoom";
"Ruw-6m-B2m.title" = "Select All";
"S0p-oC-mLd.title" = "Jump to Selection";
"Td7-aD-5lo.title" = "Window";
"UEZ-Bs-lqG.title" = "Capitalize";
"Vdr-fp-XzO.title" = "Hide Others";
"W48-6f-4Dl.title" = "Edit";
"WeT-3V-zwk.title" = "Paste and Match Style";
"Xz5-n4-O0W.title" = "Find…";
"YEy-JH-Tfz.title" = "Find and Replace…";
"Ynk-f8-cLZ.title" = "Start Speaking";
"aUF-d1-5bR.title" = "Window";
"_NS:138.title" = "Window";
"buJ-ug-pKt.title" = "Use Selection for Find";
"c8a-y6-VQd.title" = "Transformations";
"cwL-P1-jid.title" = "Smart Links";
"d9M-CD-aMd.title" = "Make Lower Case";
"dRJ-4n-Yzg.title" = "Undo";
"gVA-U4-sdL.title" = "Paste";
"hQb-2v-fYv.title" = "Smart Quotes";
"hz2-CU-CR7.title" = "Check Document Now";
"hz9-B4-Xy5.title" = "Services";
"mK6-2p-4JG.title" = "Check Grammar With Spelling";
"pa3-QI-u2k.title" = "Delete";
"q09-fT-Sye.title" = "Find Next";
"rbD-Rh-wIN.title" = "Check Spelling While Typing";
"rgM-f4-ycn.title" = "Smart Dashes";
"tRr-pd-1PS.title" = "Data Detectors";
"uQy-DD-JDr.title" = "Telegram";
"uRl-iY-unG.title" = "Cut";
"vmV-6d-7jI.title" = "Make Upper Case";
"wpr-3q-Mcd.title" = "Help";
"x3v-GG-iWU.title" = "Copy";
"1000.title" = "Check for Updates";
"xrE-MZ-jX0.title" = "Speech";
"z6F-FW-3nz.title" = "Show Substitutions";
"sZh-ct-GQS.title" = "Quick Search";

"Login.ContinueOnLanguage" = "Continue on English";
"Date.Today" = "Today";

/* This key for which language this file, for example: Italian -> Italiano, Russian -> Русский */
"AccountSettings.CurrentLanguage" = "English";
"Suggest.Localization.Header" = "Choose your language";
"Suggest.Localization.Other" = "Other";

"PrivacySettings.PeerSelect.AddNew" = "Add New";

"Channel.EditAdmin.Permission.ChangeInfo" = "Change Channel Info";
"Group.EditAdmin.Permission.ChangeInfo" = "Change Group Info";
"Channel.EditAdmin.Permission.DeleteMessages" = "Delete Messages";
"Channel.EditAdmin.Permission.BanUsers" = "Ban Users";
"Channel.EditAdmin.Permission.InviteViaLink" = "Invite Users Via Link";
"Channel.EditAdmin.Permission.PinMessages" = "Pin Messages";
"Channel.EditAdmin.Permission.AddNewAdmins" = "Add New Admins";
"Channel.EditAdmin.Permission.PostMessages" = "Post Messages";
"Channel.EditAdmin.Permission.EditMessages" = "Edit Messages";
"Channel.EditAdmin.Permission.InviteUsers" = "Invite Users";

"Channel.Persmission.Denied.SendMessages.Until" = "The admins of this group have restricted you from writing here until %@";
"Channel.Persmission.Denied.SendMessages.Forever" = "The admins of this group have restricted you from writing here";

"Channel.Persmission.Denied.SendMedia.Until" = "The admins of this group have restricted you from sending media here until %@";
"Channel.Persmission.Denied.SendMedia.Forever" = "The admins of this group have restricted you from sending media here";

"Channel.Persmission.Denied.SendStickers.Until" = "The admins of this group have restricted you from sending stickers here until %@";
"Channel.Persmission.Denied.SendStickers.Forever" = "The admins of this group have restricted you from sending stickers here";

"Channel.Persmission.Denied.SendInline.Until" = "The admins of this group have restricted you from posting inline content here until %@";
"Channel.Persmission.Denied.SendInline.Forever" = "The admins of this group have restricted you from posting inline content here";

"Channel.Admin.Dismiss" = "Dismiss Admin";
"Channel.Admin.AdminAccess" = "This Admin will be able to add new admins with the same (or more limited) permissions than he/she has.";
"Channel.Admin.AdminRestricted" = "This admin will not be able to add new admins.";

"Channel.Admin.WhatCanAdminDo" = "WHAT CAN THIS ADMIN DO?";
"PeerInfo.EventLog" = "Event Log";

"Channel.EventLog.What" = "What Is This?";
"Channel.EventLog.Alert.Header" = "What is an event log?";
"Channel.EventLog.Alert.Info" = "This is a list of all service actions taken by the group's members and admins in the last 48 hours.";


"Group.EventLog.Service.TitleUpdated" = "%@ edited group title:";
"Group.EventLog.Service.LinkUpdated" = "%@ edited group link:";
"Group.EventLog.Service.AboutUpdated" = "%@ edited group description:";

"Channel.EventLog.Service.TitleUpdated" = "%@ edited channel title:";
"Channel.EventLog.Service.LinkUpdated" = "%@ edited channel link:";
"Channel.EventLog.Service.AboutUpdated" = "%@ edited channel description:";

"Group.EventLog.Service.LinkRemoved" = "%@ removed group link:";
"Group.EventLog.Service.AboutRemoved" = "%@ removed group description:";
"Channel.EventLog.Service.LinkRemoved" = "%@ removed channel link:";
"Channel.EventLog.Service.AboutRemoved" = "%@ removed channel description:";

"EventLog.Service.PreviousTitle" = "Previous Title";
"EventLog.Service.PreviousLink" = "Previous Link";
"EventLog.Service.PreviousDesc" = "Previous Description";


"EventLog.Service.Demote.SendMessages" = "Send Messages";
"EventLog.Service.Demote.SendMedia" = "Send Media";
"EventLog.Service.Demote.SendStickers" = "Send Stickers";
"EventLog.Service.Demote.EmbedLinks" = "Embed Links";
"EventLog.Service.Demote.SendInline" = "Send Inline";

"EventLog.Service.Promote.ChangeInfo" = "Change Info";
"EventLog.Service.Promote.DeleteMessages" = "Delete Messages";
"EventLog.Service.Promote.PostMessages" = "Post Messages";
"EventLog.Service.Promote.AddUsers" = "Add Users";
"EventLog.Service.Promote.InviteViaLink" = "Invite Users Via Link";
"EventLog.Service.Promote.PinMessages" = "Pin Messages";
"EventLog.Service.Promote.AddNewAdmins" = "Add New Admins";
"EventLog.Service.Promote.BanUsers" = "Ban Users";
"EventLog.Service.Promote.EditMessages" = "Edit Messages";

"EventLog.Service.Promoted.Changed" = "changed privileges for %@ %@:";
"EventLog.Service.Promoted" = "promoted %@ %@:";

"EventLog.Service.Demoted" = "restricted %@ %@:";
"EventLog.Service.Demoted.Until" = "restricted %@ %@ until %@:";
"EventLog.Service.Demoted.Changed" = "changed restrictions for %@ %@:";
"EventLog.Service.Demoted.Changed.Until" = "changed restrictions %@ %@ until %@:";
"EventLog.Service.Banned" = "Banned %@ %@";

"EventLog.Service.Removed" = "%@ removed %@";
"EventLog.Service.DeletedMessage" = "%@ deleted message:";
"EventLog.Service.EditedMessage" = "%@ edited message:";
"EventLog.Service.UpdatePinned" = "%@ pinned message:";
"EventLog.Service.RemovePinned" = "%@ unpinned message";


"Group.EventLog.Service.EnableInvites" = "%@ enabled group invites";
"Group.EventLog.Service.DisableInvites" = "%@ disabled group invites";
"Channel.EventLog.Service.EnableSignatures" = "%@ enabled channel signatures";
"Channel.EventLog.Service.DisableSignatures" = "%@ disabled channel signatures";


"Group.EventLog.Service.PhotoUpdated" = "%@ updated group photo";
"Group.EventLog.Service.PhotoRemoved" = "%@ remove group photo";
"Channel.EventLog.Service.PhotoUpdated" = "%@ updated channel photo";
"Channel.EventLog.Service.PhotoRemoved" = "%@ removed channel photo";

"Group.EventLog.Service.UpdateLeft" = "%@ left the group";
"Channel.EventLog.Service.UpdateLeft" = "%@ left the channel";

"Group.EventLog.Service.UpdateJoin" = "%@ joined the group";
"Channel.EventLog.Service.UpdateJoin" = "%@ joined the channel";

"Telegram.ChannelEventLogController" = "All Actions";

"ChannelEventFilter.NewRestrictions" = "New Restrictions";
"ChannelEventFilter.NewAdmins" = "New Admins";
"ChannelEventFilter.NewMembers" = "New Members";
"ChannelEventFilter.GroupInfo" = "Group Info";
"ChannelEventFilter.ChannelInfo" = "Channel Info";
"ChannelEventFilter.DeletedMessages" = "Deleted Messages";
"ChannelEventFilter.EditedMessages" = "Edited Messages";
"ChannelEventFilter.PinnedMessages" = "Pinned Messages";
"ChannelEventFilter.LeavingMembers" = "Members Removed";

"Group.EventLog.EmptyText" = "**No events here yet**\n\nThere were no service actions taken by the group's members and admins for the last 48 hours.";
"Channel.EventLog.EmptyText" = "**No events here yet**\n\nThere were no service actions taken by the channel's members and admins for the last 48 hours.";
"Channel.EventLog.EmptySearch" = "** No events found**\n\nNo recent events that match your query have been found.";

"ChannelBlacklist.Restricted" = "RESTRICTED";
"ChannelBlacklist.Blocked" = "BLOCKED";
"ChannelBlacklist.AddMember" = "Add Member";

"Channel.UserRestriction" = "USER RESTRICTIONS";
"Channel.BlockUser.CanReadMessages" = "Can Read Messages";
"Channel.BlockUser.CanSendMessages" = "Can Send Messages";
"Channel.BlockUser.CanSendMedia" = "Can Send Media";
"Channel.BlockUser.CanSendStickers" = "Can Send Stickers & GIFs";
"Channel.BlockUser.CanEmbedLinks" = "Can Embed Links";
"Channel.BlockUser.BlockFor" = "Block For";
"Channel.Blacklist.SelectNewUserTitle" = "Members";
"Channel.BlockUser.Forever" = "Forever";

"Channel.Admins.PromotedBy" = "promoted by %@";
"Channel.Admins.AddAdminError" = "Sorry you can't promote this user to admin";
"Channel.Blacklist.RestrictedBy" = "restricted by %@";
"Channel.Blacklist.BlockedBy" = "blocked by %@";
"Channel.Blacklist.DemoteAdminError" = "Sorry, you can't ban this user because they are an admin in this group and you are not allowed to demote them.";

"Channel.Admins.Promote.BannedAdminError" = "Sorry, you can't add this user as an admin because they are in the blacklist and you can't unban them.";
"Channel.Admins.Promote.UnmemberAdminError" = "Sorry, you can't add this user as an admin because they are not a member of this group and you are not allowed to invite them.";
"Channel.BanForever" = "Forever";

"Channel.EventFilter.EventsHeader" = "EVENTS";
"Channel.EventFilter.AdminsHeader" = "ADMINS";

"Channel.SelectPeers.Members" = "members";
"Channel.SelectPeers.Contacts" = "contacts";
"Channel.SelectPeers.Global" = "global";
"Channel.SelectPeers.Header" = "Members";

"Supergroup.DeleteRestriction.DeleteMessage" = "Delete Message";
"Supergroup.DeleteRestriction.BanUser" = "Ban User";
"Supergroup.DeleteRestriction.ReportSpam" = "Report Spam";
"Supergroup.DeleteRestriction.DeleteAllMessages" = "Delete All Messages";
"ChannelAdmins.RecentActions" = "Recent Actions";


"Telegram.ProxySettingsViewController" = "Proxy";
"ProxySettings.ConnectionHeader" = "Connection";
"ProxySettings.CredentialsHeader" = "CREDENTIALS (OPTIONAL)";
"ProxySettings.Disabled" = "Disabled";
"ProxySettings.Socks5" = "SOCKS5";
"ProxySettings.Server" = "Server";
"ProxySettings.Port" = "Port";
"ProxySettings.Username" = "Username";
"ProxySettings.Password" = "Password";
"ProxySettings.Save" = "Save";

"Channel.EventLog.OriginalMessage" = "Original message";
"Channel.EventLog.Empty" = "Empty";
"Channel.Admin.CantEditRights" = "You cannot edit the rights of this admin.";
"Channel.Blacklist.Unban" = "Unban";

"ConnectingStatus.DisableProxy" = "click here to disable proxy";
"Proxy.ForceDisable" = "Are you sure you want to disable proxy server %@?";
"Proxy.ForceEnable.Header" = "Are you sure you want to enable this proxy?";
"Proxy.ForceEnable.Text.IP" = "Server: %@";
"Proxy.ForceEnable.Text.Port" = "Port: %d";
"Proxy.ForceEnable.Text.Username" = "Username: %@";
"Proxy.ForceEnable.Text.Password" = "Password: %@";
"Proxy.ForceEnable.Text" = "You can change your proxy server later in the Settings (Privacy and Security).";
"ProxySettings.Share" = "Share this link with friends to circumvent censorship in your country";
"ProxySettings.ExportLink" = "Export link from clipboard";
"ProxySettings.ProxyNotFound" = "Proxy settings not found in clipboard.";
"ProxySettings.ExportDescription" = "If your clipboard contains socks5-link (**t.me/socks?server=127.0.0.1&port=80**) it will apply immediately";
